public class task3 {
    public static void main(String[] args) {
        for (int i = 10; (i < 21 && i > 9 ); i++) {
            if(i % 2 == 0){
                System.out.print(i + " ");
            }
        }
    }
}
/*
Задача 3:
        Используя for вывести каждое четное число от 2 до 20 включительно и больше 10.*/
